library("MASS")
data(Cars93)
attach(Cars93)
print(Cars93)

cat("********************************************************************\n")
cat("Коэффициенты кореляции и ковариации для столбцов EngineSize, HorsePower: \n")
cat("Коэффициент ковариации: \n")
cov(EngineSize, Horsepower)
cat("Коэффициент кореляции: \n")
cor(EngineSize, Horsepower)
cat("********************************************************************\n")



cat("********************************************************************\n")
cat("Коэффициенты кореляции и ковариации для столбцов Price, HorsePower: \n")
cat("Коэффициент ковариации: \n")
cov(Price, Horsepower)
cat("Коэффициент кореляции: \n")
cor(Price, Horsepower)
cat("********************************************************************\n")



cat("********************************************************************\n")
cat("Коэффициенты кореляции и ковариации для столбцов EngineSize, Fuel.tank.capacity: \n")
cat("Коэффициент ковариации: \n")
cov(EngineSize, Fuel.tank.capacity)
cat("Коэффициент кореляции: \n")
cor(EngineSize, Fuel.tank.capacity)
cat("********************************************************************\n")



cat("********************************************************************\n")
cat("Коэффициенты кореляции и ковариации для столбцов Passengers, Weight: \n")
cat("Коэффициент ковариации: \n")
cov(Passengers, Weight)
cat("Коэффициент кореляции: \n")
cor(Passengers, Weight)
cat("********************************************************************\n")



cat("********************************************************************\n")
cat("Коэффициенты кореляции и ковариации для столбцов Weight, Price: \n")
cat("Коэффициент ковариации: \n")
cov(Weight, Price)
cat("Коэффициент кореляции: \n")
cor(Weight, Price)
cat("********************************************************************\n")



cat("********************************************************************\n")
cat("Коэффициенты кореляции и ковариации для столбцов RPM, HorsePower: \n")
cat("Коэффициент ковариации: \n")
cov(RPM, Horsepower)
cat("Коэффициент кореляции: \n")
cor(RPM, Horsepower)
cat("********************************************************************\n")
