library("MASS")
data(Cars93)
head(Cars93)


#x <- as.numeric(Cars93[12])
#y <- as.numeric(Cars93[13])

#cor.test(x, y)

cat("********************************************************************\n")
cat("Коэффициенты кореляции и ковариации для столбцов EngineSize, HorsePower: \n")
cat("Коэффициент ковариации: \n")
cov(Cars93[12], Cars93[13])
cat("Коэффициент кореляции: \n")
cor(Cars93[12], Cars93[13])
cat("********************************************************************\n")



cat("********************************************************************\n")
cat("Коэффициенты кореляции и ковариации для столбцов Price, HorsePower: \n")
cat("Коэффициент ковариации: \n")
cov(Cars93[5], Cars93[13])
cat("Коэффициент кореляции: \n")
cor(Cars93[5], Cars93[13])
cat("********************************************************************\n")



cat("********************************************************************\n")
cat("Коэффициенты кореляции и ковариации для столбцов EngineSize, Fuel.tank.capacity: \n")
cat("Коэффициент ковариации: \n")
cov(Cars93[12], Cars93[17])
cat("Коэффициент кореляции: \n")
cor(Cars93[12], Cars93[17])
cat("********************************************************************\n")



cat("********************************************************************\n")
cat("Коэффициенты кореляции и ковариации для столбцов Passengers, Weight: \n")
cat("Коэффициент ковариации: \n")
cov(Cars93[18], Cars93[25])
cat("Коэффициент кореляции: \n")
cor(Cars93[18], Cars93[25])
cat("********************************************************************\n")



cat("********************************************************************\n")
cat("Коэффициенты кореляции и ковариации для столбцов Weight, Price: \n")
cat("Коэффициент ковариации: \n")
cov(Cars93[25], Cars93[5])
cat("Коэффициент кореляции: \n")
cor(Cars93[25], Cars93[5])
cat("********************************************************************\n")



cat("********************************************************************\n")
cat("Коэффициенты кореляции и ковариации для столбцов RPM, HorsePower: \n")
cat("Коэффициент ковариации: \n")
cov(Cars93[14], Cars93[13])
cat("Коэффициент кореляции: \n")
cor(Cars93[14], Cars93[13])
cat("********************************************************************\n")
